In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# load dataset
sheets = pd.read_excel("regional_sales_analysis_dataset.xlsx", sheet_name=None)

In [4]:
sheets.keys()

dict_keys(['Sales Orders', 'Customers', 'Regions', 'State Regions', 'Products', '2017 Budgets'])

In [5]:
# assign dataframes to each sheet
df_sales = sheets["Sales Orders"]
df_customers = sheets["Customers"]
df_regions = sheets["Regions"]
df_state_regions = sheets["State Regions"]
df_products = sheets["Products"]
df_2017_budgets = sheets["2017 Budgets"]

In [6]:
df_sales.head()

,OrderNumber,OrderDate,Customer Name Index,Channel,Currency Code,Warehouse Code,Delivery Region Index,Product Description Index,Order Quantity,Unit Price,Line Total,Total Unit Cost
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,14994.6,1824.343
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,25868.7,1269.918
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,5869.2,684.740
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,16368.1,1028.852
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,18331.2,1260.270

In [9]:
print("df_sales shape:", df_sales.shape)
print("df_customers:", df_customers.shape)
print("df_regions:", df_regions.shape)
print("df_state_regions:", df_state_regions.shape)
print("df_products:",df_products.shape)
print("df_2017_budgets:",df_2017_budgets.shape)

df_sales shape: (64104, 12)
df_customers: (175, 2)
df_regions: (994, 15)
df_state_regions: (49, 3)
df_products: (30, 2)
df_2017_budgets: (30, 2)

In [10]:
df_state_regions.head()

      Column1     Column2 Column3
0  State Code       State  Region
1          AL     Alabama   South
2          AR    Arkansas   South
3          AZ     Arizona    West
4          CA  California    West

In [19]:
# header correcting
new_header = df_state_regions.iloc[0]
df_state_regions.columns = new_header
df_state_regions = df_state_regions[1:].reset_index(drop=True)
df_state_regions.head()

0 State Code       State Region
0         AL     Alabama  South
1         AR    Arkansas  South
2         AZ     Arizona   West
3         CA  California   West
4         CO    Colorado   West

In [22]:
# checking null values
df_sales.isnull().sum()

OrderNumber                  0
OrderDate                    0
Customer Name Index          0
Channel                      0
Currency Code                0
Warehouse Code               0
Delivery Region Index        0
Product Description Index    0
Order Quantity               0
Unit Price                   0
Line Total                   0
Total Unit Cost              0
dtype: int64

In [ ]:
df_customers.isnull().sum()

Customer Index    0
Customer Names    0
dtype: int64

In [ ]:
# Data cleaning and wrangling
# merge sales table with customers
df = df_sales.merge(  
    df_customers,
    how = "left",
    left_on= "Customer Name Index",
    right_on= "Customer Index"
)

In [25]:
df.head()

,OrderNumber,OrderDate,Customer Name Index,Channel,Currency Code,Warehouse Code,Delivery Region Index,Product Description Index,Order Quantity,Unit Price,Line Total,Total Unit Cost,Customer Index,Customer Names
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,14994.6,1824.343,126,Rhynoodle Ltd
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,25868.7,1269.918,96,Thoughtmix Ltd
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,5869.2,684.740,8,Amerisourc Corp
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,16368.1,1028.852,42,Colgate-Pa Group
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,18331.2,1260.270,73,Deseret Group

In [26]:
# merge df with regions
df = df.merge(
    df_regions,
    how = "left",
    left_on = "Delivery Region Index",
    right_on = "id"
)

In [33]:
# merge df with state_region
df = df.merge(
    df_state_regions[["State Code","Region"]],
    how = "left",
    left_on = "state_code",
    right_on = "State Code"
)

In [35]:
# merge df with df_products
df = df.merge(
    df_products,
    how = "left",
    left_on = "Product Description Index",
    right_on = "Index"
)

In [38]:
# merge df with df_2017_budget
df = df.merge(
    df_2017_budgets,
    how = "left",
    left_on = "Product Name",
    right_on = "Product Name"
)

In [40]:
df.head(5)

,OrderNumber,OrderDate,Customer Name Index,Channel,Currency Code,Warehouse Code,Delivery Region Index,Product Description Index,Order Quantity,Unit Price,...,households,median_income,land_area,water_area,time_zone,State Code,Region,Index,Product Name,2017 Budgets
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,...,52798,36466,268318796,13908113,America/New York,GA,South,27,Product 27,964940.231
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,...,20975,54176,72276415,1883,America/Indiana/Indianapolis,IN,Midwest,20,Product 20,2067108.120
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,...,26020,124759,62489257,386195,America/Los Angeles,CA,West,26,Product 26,5685138.270
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,...,30232,30019,60221613,475857,America/Indiana/Indianapolis,IN,Midwest,7,Product 7,889737.555
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,...,24141,63158,70972793,720300,America/New York,CT,Northeast,8,Product 8,1085037.329

In [42]:
df.to_csv("sales.csv")

In [43]:
# columns to drop :-
# Customer Index
# id
# state Code
# index

cols_to_drop = ["Customer Index","id","State Code","index"]
df =df.drop(columns = cols_to_drop, errors = 'ignore')

In [47]:
df.head()

,OrderNumber,OrderDate,Customer Name Index,Channel,Currency Code,Warehouse Code,Delivery Region Index,Product Description Index,Order Quantity,Unit Price,...,area_code,population,households,median_income,land_area,water_area,time_zone,Region,Product Name,2017 Budgets
0,SO - 000225,2014-01-01,126,Wholesale,USD,AXW291,364,27,6,2499.1,...,912,145674,52798,36466,268318796,13908113,America/New York,South,Product 27,964940.231
1,SO - 0003378,2014-01-01,96,Distributor,USD,AXW291,488,20,11,2351.7,...,317,55586,20975,54176,72276415,1883,America/Indiana/Indianapolis,Midwest,Product 20,2067108.120
2,SO - 0005126,2014-01-01,8,Wholesale,USD,AXW291,155,26,6,978.2,...,925,79510,26020,124759,62489257,386195,America/Los Angeles,West,Product 26,5685138.270
3,SO - 0005614,2014-01-01,42,Export,USD,AXW291,473,7,7,2338.3,...,812,84067,30232,30019,60221613,475857,America/Indiana/Indianapolis,Midwest,Product 7,889737.555
4,SO - 0005781,2014-01-01,73,Wholesale,USD,AXW291,256,8,8,2291.4,...,959,58007,24141,63158,70972793,720300,America/New York,Northeast,Product 8,1085037.329

In [48]:
#convert column names into lower case for consistency
df.columns = df.columns.str.lower()

df.columns.values

array(['ordernumber', 'orderdate', 'customer name index', 'channel',
       'currency code', 'warehouse code', 'delivery region index',
       'product description index', 'order quantity', 'unit price',
       'line total', 'total unit cost', 'customer names', 'name',
       'county', 'state_code', 'state', 'type', 'latitude', 'longitude',
       'area_code', 'population', 'households', 'median_income',
       'land_area', 'water_area', 'time_zone', 'region', 'product name',
       '2017 budgets'], dtype=object)

In [53]:
cols_to_keep = ["ordernumber",
                'orderdate',
                'customer names',
               'channel',
               'product name',
               'order quantity',
               'unit price',
               'line total',
               'total unit cost',
               'state_code',
               'county',
               'state',
               'region',
               'latitude',
               'longitude',
               '2017 budgets'

]

In [54]:
df = df[cols_to_keep]

In [56]:
df.head(2)

,ordernumber,orderdate,customer names,channel,product name,order quantity,unit price,line total,total unit cost,state_code,county,state,region,latitude,longitude,2017 budgets
0,SO - 000225,2014-01-01,Rhynoodle Ltd,Wholesale,Product 27,6,2499.1,14994.6,1824.343,GA,Chatham County,Georgia,South,32.08354,-81.09983,964940.231
1,SO - 0003378,2014-01-01,Thoughtmix Ltd,Distributor,Product 20,11,2351.7,25868.7,1269.918,IN,Johnson County,Indiana,Midwest,39.61366,-86.10665,2067108.120

In [57]:
df.columns.values

array(['ordernumber', 'orderdate', 'customer names', 'channel',
       'product name', 'order quantity', 'unit price', 'line total',
       'total unit cost', 'state_code', 'county', 'state', 'region',
       'latitude', 'longitude', '2017 budgets'], dtype=object)

In [ ]:
df = df.rename(columns = {
     'ordernumber' : 'order_number',
     'orderdate' : 'order_date',
     'customer names' : 'customer_names',
     'product name' : 'product_name',
     'order quantity' : 'order_quantity',
     'unit price' : 'unit_price',
     'line total' : 'revenue',
     'total unit cost' : 'total unit cost',
     'state_code' : 'state',
     'state' : 'state_name',
     'latitude' : 'lat',
     'longtitude' : 'lon',
     '2017 budgets' : 'budget' 
})

In [61]:
# blank out budgets for non - 2017 budgets
df.loc[df['order_date'].dt.year != 2017, "budget"] = pd.NA 

df[['order_date', 'product_name','revenue','budget']].head(5)

  order_date product_name  revenue  budget
0 2014-01-01   Product 27  14994.6     NaN
1 2014-01-01   Product 20  25868.7     NaN
2 2014-01-01   Product 26   5869.2     NaN
3 2014-01-01    Product 7  16368.1     NaN
4 2014-01-01    Product 8  18331.2     NaN

In [64]:
df.to_csv("final.csv")

In [65]:
df.columns.values

array(['order_number', 'order_date', 'customer_names', 'channel',
       'product_name', 'order_quantity', 'unit_price', 'revenue',
       'total unit cost', 'state', 'county', 'state_name', 'region',
       'lat', 'longitude', 'budget', 'budgets'], dtype=object)

In [68]:
df.drop(columns = ["budgets"],inplace=True)

In [69]:
df.head()

,order_number,order_date,customer_names,channel,product_name,order_quantity,unit_price,revenue,total unit cost,state,county,state_name,region,lat,longitude,budget
0,SO - 000225,2014-01-01,Rhynoodle Ltd,Wholesale,Product 27,6,2499.1,14994.6,1824.343,GA,Chatham County,Georgia,South,32.08354,-81.09983,NaN
1,SO - 0003378,2014-01-01,Thoughtmix Ltd,Distributor,Product 20,11,2351.7,25868.7,1269.918,IN,Johnson County,Indiana,Midwest,39.61366,-86.10665,NaN
2,SO - 0005126,2014-01-01,Amerisourc Corp,Wholesale,Product 26,6,978.2,5869.2,684.740,CA,Alameda County,California,West,37.66243,-121.87468,NaN
3,SO - 0005614,2014-01-01,Colgate-Pa Group,Export,Product 7,7,2338.3,16368.1,1028.852,IN,Monroe County,Indiana,Midwest,39.16533,-86.52639,NaN
4,SO - 0005781,2014-01-01,Deseret Group,Wholesale,Product 8,8,2291.4,18331.2,1260.270,CT,Hartford County,Connecticut,Northeast,41.77524,-72.52443,NaN

In [70]:
df.to_csv("final_file.csv")

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64104 entries, 0 to 64103
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_number     64104 non-null  object
 1   order_date       64104 non-null  datetime64[ns]
 2   customer_names   64104 non-null  object
 3   channel          64104 non-null  object
 4   product_name     64104 non-null  object
 5   order_quantity   64104 non-null  int64
 6   unit_price       64104 non-null  float64
 7   revenue          64104 non-null  float64
 8   total unit cost  64104 non-null  float64
 9   state            64104 non-null  object
 10  county           64104 non-null  object
 11  state_name       64104 non-null  object
 12  region           64104 non-null  object
 13  lat              64104 non-null  float64
 14  longitude        64104 non-null  float64
 15  budget           15263 non-null  float64
dtypes: datetime64[ns](1), float64(6), int64(1), object(8)
memory usage: 7.8+ MB

In [72]:
# extract only 2017 data 
df_2017 = df[df["order_date"].dt.year == 2017]

In [81]:
df_2017.head(2)

,order_number,order_date,customer_names,channel,product_name,order_quantity,unit_price,revenue,total unit cost,state,county,state_name,region,lat,longitude,budget
46363,SO - 0002544,2017-01-01,NCS Group,Wholesale,Product 30,6,1239.5,7437.0,1028.785,NJ,Hudson County,New Jersey,Northeast,40.77955,-74.02375,1011609.684
46364,SO - 0006431,2017-01-01,Epic Group,Wholesale,Product 13,5,1829.1,9145.5,1207.206,CO,Mesa County,Colorado,West,39.06387,-108.55065,3720639.645

In [75]:
# calculate total cost fro company 
df["total_cost"] = df["order_quantity"] * df["total unit cost"] # total unit cost = company cost

In [77]:
# calculate profit
df["profit"] = df["revenue"] - df["total_cost"]

In [79]:
# calculate profit margin
df["profit_margin"] = (df["profit"]/df["revenue"])*100

In [80]:
df.head()

,order_number,order_date,customer_names,channel,product_name,order_quantity,unit_price,revenue,total unit cost,state,county,state_name,region,lat,longitude,budget,total_cost,profit,profit_margin
0,SO - 000225,2014-01-01,Rhynoodle Ltd,Wholesale,Product 27,6,2499.1,14994.6,1824.343,GA,Chatham County,Georgia,South,32.08354,-81.09983,NaN,10946.058,4048.542,27.0
1,SO - 0003378,2014-01-01,Thoughtmix Ltd,Distributor,Product 20,11,2351.7,25868.7,1269.918,IN,Johnson County,Indiana,Midwest,39.61366,-86.10665,NaN,13969.098,11899.602,46.0
2,SO - 0005126,2014-01-01,Amerisourc Corp,Wholesale,Product 26,6,978.2,5869.2,684.740,CA,Alameda County,California,West,37.66243,-121.87468,NaN,4108.440,1760.760,30.0
3,SO - 0005614,2014-01-01,Colgate-Pa Group,Export,Product 7,7,2338.3,16368.1,1028.852,IN,Monroe County,Indiana,Midwest,39.16533,-86.52639,NaN,7201.964,9166.136,56.0
4,SO - 0005781,2014-01-01,Deseret Group,Wholesale,Product 8,8,2291.4,18331.2,1260.270,CT,Hartford County,Connecticut,Northeast,41.77524,-72.52443,NaN,10082.160,8249.040,45.0

In [91]:
df.to_csv("final_sales_file.csv")